{
  "heading": "Project Slate",
  "intro": "Our original collection of genre works.",
  "projects": [
    {
      "id": "jack-knife-jackie",
      "title": "Jacknife Jackie",
      "slug": "jack-knife-jackie",
      "poster": "/images/projects/Jack_Knife_Jackie.webp",
      "year": "2025",
      "genre": "Horror Thriller",
      "status": "In Development",
      "logline": "A lonely long-haul trucker abducts a stranded man and traps him inside the decaying 1970s apartment she has built in the back of her refrigerated trailer. As she carries him across the country in a delusional attempt to create the perfect relationship, he discovers she will murder anyone who threatens her fantasy. His only hope for survival is to escape before she reaches his family and eliminates them to keep him all to herself.",
      "isVaulted": false,
      "sortOrder": 1
    },
    {
      "id": "invalid",
      "title": "Invalid",
      "slug": "invalid",
      "poster": "/images/projects/invalid_poster.webp",
      "year": "2025",
      "genre": "Psychological Horror",
      "status": "In Development",
      "logline": "After a car accident leaves Lynn, an affluent and successful woman, physically disabled, she has premonitions that her live-in nurse, Alex, wants her dead so Alex can take Lynn's place in Lynn's seemingly-perfect life.",
      "isVaulted": false,
      "sortOrder": 2
    },
    {
      "id": "a-cold-heart",
      "title": "A Cold Heart",
      "slug": "a-cold-heart",
      "poster": "/images/projects/a_cold_heart_poster.webp",
      "year": "2025",
      "genre": "Slasher",
      "status": "In Development",
      "logline": "After chronic pain costs her the man she loves, Georgia joins a remote Northern retreat where cold dips and psychedelics mask a Nordic healer's belief that suffering can only be cured by killing the body that feels it and what begins as a wellness getaway becomes a fight for survival when their sociopathic host transforms ice baths into executions.",
      "isVaulted": false,
      "sortOrder": 3
    },
    {
      "id": "the-itch",
      "title": "The Itch",
      "slug": "the-itch",
      "poster": "/images/projects/the_itch_poster.webp",
      "year": "2025",
      "genre": "Supernatural Horror",
      "status": "In Development",
      "logline": "When a hidden affair awakens the ancient curse of The Itch, a devoted surgeon's forbidden lust transforms into a nightmarish obsession that drives him to violently destroy his own family.",
      "isVaulted": false,
      "sortOrder": 4
    },
    {
      "id": "nutjob",
      "title": "Nutjob",
      "slug": "nutjob",
      "poster": "/images/projects/Nutjob_poster.webp",
      "year": "2025",
      "genre": "Creature Horror",
      "status": "In Development",
      "logline": "After a bad breakup, Simone's determined to focus her energy on a new crush, but on a group weekend in the woods camping with a bachelor party, she discovers ancient parasitic spiders hellbent on reproduction, and something even more disgusting and dangerous than that: the true colors of her crush.",
      "isVaulted": false,
      "sortOrder": 5
    },
    {
      "id": "trauma-bond",
      "title": "Trauma Bond",
      "slug": "trauma-bond",
      "poster": "/images/projects/Trauma_Bond_Poster.webp",
      "year": "2025",
      "genre": "Psychological Thriller",
      "status": "In Development",
      "logline": "A traumatized widow becomes the lone witness to a murder and pursues the case, along with the victim's brother, for the closure she never got until the killer turns her grief into a deadly weapon.",
      "isVaulted": false,
      "sortOrder": 6
    }
  ]
}
